Revit 2027 API
PanelScheduleSheetInstance.SplitSegment Method
 Split the panel schedule into Thrown if the index is out of bounds.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SplitSegment(
	int iSeg
)
Public Function SplitSegment (
	iSeg As Integer
) As Boolean
public:
bool SplitSegment(
	int iSeg
)
member SplitSegment :
        iSeg : int -> bool
Parameters
iSeg Int32
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  The iSeg is not a valid segment index. -or-
See Also
Reference
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace